{
  "aapl": {
    "symbol": "AAPL",
    "companyName": "Apple, Inc.",
    "exchange": "NASDAQ",
    "industry": "Telecommunications Equipment",
    "website": "http://www.apple.com",
    "description": "Apple, Inc. engages in the design, manufacture, and sale of smartphones, personal computers, tablets, wearables and accessories, and other variety of related services. It operates through the following geographical segments: Americas, Europe, Greater China, Japan, and Rest of Asia Pacific. The Americas segment includes North and South America. The Europe segment consists of European countries, as well as India, the Middle East, and Africa. The Greater China segment comprises of China, Hong Kong, and Taiwan. The Rest of Asia Pacific segment includes Australia and Asian countries. Its products and services include iPhone, Mac, iPad, AirPods, Apple TV, Apple Watch, Beats products, Apple Care, iCloud, digital content stores, streaming, and licensing services. The company was founded by Steven Paul Jobs, Ronald Gerald Wayne, and Stephen G. Wozniak on April 1, 1976 and is headquartered in Cupertino, CA.",
    "ceo": "Timothy Donald Cook",
    "securityName": "Apple Inc.",
    "issueType": "cs",
    "sector": "Electronic Technology",
    "primarySicCode": 3663,
    "employees": 137000,
    "tags": [
      "Electronic Technology",
      "Telecommunications Equipment"
    ],
    "address": "One Apple Park Way",
    "address2": null,
    "state": "CA",
    "city": "Cupertino",
    "zip": "95014-2083",
    "country": "US",
    "phone": "1.408.996.1010"
  },
  "ibm": {
    "symbol": "IBM",
    "companyName": "International Business Machines Corp.",
    "exchange": "New York Stock Exchange",
    "industry": "Information Technology Services",
    "website": "http://www.ibm.com",
    "description": "International Business Machines Corp. is an information technology company, which provides integrated solutions that leverage information technology and knowledge of business processes. It operates through the following segments: Cognitive Solutions, Global Business Services, Technology Services & Cloud Platforms, Systems, and Global Financing. The Cognitive Solutions segment comprises a portfolio of capabilities that help IBM's clients to identify actionable insights and inform decision making for competitive advantage. It includes Watson, a cognitive computing platform that has the ability to interact in natural language, process amounts of big data, and learn from interactions with people and computers. This segment consists of Solutions Software, which provides the basis for many of the company's strategic areas including analytics, security and social; and Transaction Processing Software, which includes software that primarily runs mission-critical systems in industries such as banking, airlines and retail. The Global Business Services segment provides clients with consulting, application management and global process services. The Technology Services & Cloud Platforms segment provides comprehensive IT infrastructure and platform services that create business value for clients. The Systems segment provides clients with innovative infrastructure platforms to help meet the requirements of hybrid cloud and enterprise AI workload. The Global Financing segment encompasses two primary businesses: financing, primarily conducted through IBM Credit LLC, and remanufacturing and remarketing. The company was founded by Charles Ranlett Flint and Thomas J. Watson Sr. on June 16, 1911 and is headquartered in Armonk, NY.",
    "ceo": "Virginia M. Rometty",
    "securityName": "International Business Machines Corporation",
    "issueType": "cs",
    "sector": "Technology Services",
    "primarySicCode": 7373,
    "employees": null,
    "tags": [
      "Technology Services",
      "Information Technology Services"
    ],
    "address": "1 New Orchard Road",
    "address2": null,
    "state": "NY",
    "city": "Armonk",
    "zip": "10504-1722",
    "country": "US",
    "phone": "1.914.499.1900"
  },
  "amzn": {
    "symbol": "AMZN",
    "companyName": "Amazon.com, Inc.",
    "exchange": "NASDAQ",
    "industry": "Internet Retail",
    "website": "http://www.amazon.com",
    "description": "Amazon.com, Inc. engages in the provision of online retail shopping services. It operates through the following business segments: North America, International, and Amazon Web Services (AWS). The North America segment includes retail sales of consumer products and subscriptions through North America-focused websites such as www.amazon.com and www.amazon.ca. The International segment offers retail sales of consumer products and subscriptions through internationally-focused websites. The Amazon Web Services segment involves in the global sales of compute, storage, database, and AWS service offerings for start-ups, enterprises, government agencies, and academic institutions. The company was founded by Jeffrey P. Bezos in July 1994 and is headquartered in Seattle, WA.",
    "ceo": "Jeffrey P. Bezos",
    "securityName": "Amazon.com, Inc.",
    "issueType": "cs",
    "sector": "Retail Trade",
    "primarySicCode": 5961,
    "employees": 798000,
    "tags": [
      "Retail Trade",
      "Internet Retail"
    ],
    "address": "410 Terry Avenue North",
    "address2": null,
    "state": "WA",
    "city": "Seattle",
    "zip": "98109-5210",
    "country": "US",
    "phone": "1.206.266.1000"
  },
  "goog": {
    "symbol": "GOOG",
    "companyName": "Alphabet, Inc.",
    "exchange": "NASDAQ",
    "industry": "Internet Software/Services",
    "website": "http://abc.xyz",
    "description": "Alphabet, Inc. is a holding company, which engages in the business of acquisition and operation of different companies. It operates through the Google and Other Bets segments. The Google segment includes its main Internet products such as ads, Android, Chrome, hardware, Google Cloud, Google Maps, Google Play, Search, and YouTube. The Other Bets segment consists of businesses such as Access, Calico, CapitalG, GV, Verily, Waymo, and X. The company was founded by Lawrence E. Page and Sergey Mikhaylovich Brin on October 2, 2015 and is headquartered in Mountain View, CA.",
    "ceo": "Sundar Pichai",
    "securityName": "Alphabet Inc. Class C",
    "issueType": "cs",
    "sector": "Technology Services",
    "primarySicCode": 7375,
    "employees": 118899,
    "tags": [
      "Technology Services",
      "Internet Software/Services"
    ],
    "address": "1600 Amphitheatre Parkway",
    "address2": null,
    "state": "CA",
    "city": "Mountain View",
    "zip": "94043",
    "country": "US",
    "phone": "1.650.253.0000"
  },
  "pbr": {
    "symbol": "PBR",
    "companyName": "Petróleo Brasileiro SA",
    "exchange": "New York Stock Exchange",
    "industry": "Integrated Oil",
    "website": "http://www.petrobras.com.br",
    "description": "Petróleo Brasileiro SA engages in oil and gas exploration, production, and distribution activities. It operates through the following segments: Exploration and Production; Refining, Transportation, and Marketing; Distribution; Gas & Power; Biofuel; and Corporate. The Exploration and Production segment involves crude oil, natural gas liquids, and natural gas exploration, development, and production. The Refining, Transportation and Marketing segment involves refining, logistics, transportation, trading operations, oil products and crude oil exports and imports, and petrochemical investments. The Distribution segment refers to the distribution of oil products, ethanol, and vehicle natural gas to wholesalers and through Petrobras Distribuidora SA, its retail network in Brazil. The Gas & Power segment includes transportation and trading of natural and liquefied natural gas, the generation and trading of electric power, and the fertilizer business. The Biofuel segment involves the production of biodiesel and its co-products, and ethanol-related activities such as equity investments, production, and trading of ethanol, sugar, and the excess electricity generated from sugarcane bagasse. The Corporate segment comprises the financing activities not attributable to other segments including corporate financial management, and central administrative overhead and actuarial expenses. The company was founded on October 3, 1953 and is headquartered in Rio de Janeiro, Brazil.",
    "ceo": "Roberto da Cunha Castello Branco",
    "securityName": "Petroleo Brasileiro SA Sponsored ADR",
    "issueType": "ad",
    "sector": "Energy Minerals",
    "primarySicCode": 1311,
    "employees": 68829,
    "tags": [
      "Energy Minerals",
      "Integrated Oil"
    ],
    "address": "Avenida República do Chile 65",
    "address2": null,
    "state": null,
    "city": "Rio de Janeiro",
    "zip": "20031-912",
    "country": "BR",
    "phone": "55.21.3224.4477"
  },
  "bac": {
    "symbol": "BAC",
    "companyName": "Bank of America Corp.",
    "exchange": "New York Stock Exchange",
    "industry": "Major Banks",
    "website": "http://www.bankofamerica.com",
    "description": "Bank of America Corp. is a bank and financial holding company, which engages in the provision of banking and nonbank financial services. It operates through the following segments: Consumer Banking, Global Wealth and Investment Management, Global Banking, Global Markets, and All Other. The Consumer Banking segment offers credit, banking, and investment products and services to consumers and small businesses. The Global Wealth and Investment Management provides client experience through a network of financial advisors focused on to meet their needs through a full set of investment management, brokerage, banking, and retirement products. The Global Banking segment deals with lending-related products and services, integrated working capital management and treasury solutions to clients, and underwriting and advisory services. The Global Markets segment includes sales and trading services, as well as research, to institutional clients across fixed-income, credit, currency, commodity, and equity businesses. The All Other segment consists of asset and liability management activities, equity investments, non-core mortgage loans and servicing activities, the net impact of periodic revisions to the mortgage servicing rights (MSR) valuation model for both core and non-core MSRs, other liquidating businesses, residual expense allocations and other. The company was founded by Amadeo Peter Giannini in 1904 is headquartered in Charlotte, NC.",
    "ceo": "Brian T. Moynihan",
    "securityName": "Bank of America Corp",
    "issueType": "cs",
    "sector": "Finance",
    "primarySicCode": 6021,
    "employees": null,
    "tags": [
      "Finance",
      "Major Banks"
    ],
    "address": "100 North Tryon Street",
    "address2": null,
    "state": "NC",
    "city": "Charlotte",
    "zip": "28255",
    "country": "US",
    "phone": "1.704.386.5681"
  },
  "ge": {
    "symbol": "GE",
    "companyName": "General Electric Co.",
    "exchange": "New York Stock Exchange",
    "industry": "Aerospace & Defense",
    "website": "http://www.ge.com",
    "description": "General Electric Co. is a technology and financial services company. It operates through the following segments: Power, Renewable Energy, Aviation, Healthcare, and Capital. The Power segment offers technologies, solutions, and services related to energy production, which includes gas and steam turbines, generators, and power generation services. The Renewable Energy segment provides wind turbine platforms, hardware & software, offshore wind turbines, solutions, products & services to hydropower industry, blades for onshore & offshore wind turbines, and high voltage equipment. The Aviation segment provides jet engines & turboprops for commercial airframes, maintenance, component repair, and overhaul services, as well as replacement parts, additive machines & materials, and engineering services. The Healthcare segment provides healthcare technologies in medical imaging, digital solutions, patient monitoring, and diagnostics, drug discovery, biopharmaceutical manufacturing technologies and performance enhancement solutions. The Capital segment leases & finances aircraft, aircraft engines and helicopters, and also provides financial and underwriting solutions. The company was founded by Thomas Alva Edison in 1878 and is headquartered in Boston, MA.",
    "ceo": "H. Lawrence Culp",
    "securityName": "General Electric Company",
    "issueType": "cs",
    "sector": "Electronic Technology",
    "primarySicCode": 3724,
    "employees": null,
    "tags": [
      "Producer Manufacturing",
      "Industrial Conglomerates",
      "Aerospace & Defense",
      "Electronic Technology"
    ],
    "address": "5 Necco Street",
    "address2": null,
    "state": "MA",
    "city": "Boston",
    "zip": "02210",
    "country": "US",
    "phone": "1.617.443.3000"
  },
  "snap": {
    "symbol": "SNAP",
    "companyName": "Snap, Inc.",
    "exchange": "New York Stock Exchange",
    "industry": "Internet Software/Services",
    "website": "http://www.snap.com",
    "description": "Snap, Inc. engages in the operation of its camera platform. Its products include Snapchat, using the camera and editing tools to take and share Snaps, Friends Page, which lets users create and use Stories, Groups, Video and Chat, Discover for searching and surfacing relevant Stories, Snap Map, which shows friends, Stories and Snaps near the user, Memories, for saving personal collections, and Spectacles, wearable sunglasses capable of taking Snaps and interacting directly with the Snapchat application. The company's primary source of revenue is advertising. Snap was founded by Frank Reginald Brown IV, Evan Thomas Spiegel, and Robert C. Murphy in 2010 and is headquartered in Santa Monica, CA.",
    "ceo": "Evan Thomas Spiegel",
    "securityName": "Snap, Inc. Class A",
    "issueType": "cs",
    "sector": "Technology Services",
    "primarySicCode": 7375,
    "employees": 3195,
    "tags": [
      "Technology Services",
      "Internet Software/Services",
      "Miscellaneous Commercial Services",
      "Commercial Services"
    ],
    "address": "2772 Donald Douglas Loop North",
    "address2": null,
    "state": "CA",
    "city": "Santa Monica",
    "zip": "90405",
    "country": "US",
    "phone": "1.310.399.3339"
  }
}